**`teams/nomis/windows_server_2019_jumpserver`** terragrunt plan on `pull_request` event [#982](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 2s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["jumpserver_2019.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.imagebuilder.aws_imagebuilder_component.this["jumpserver_2019.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver-2019/1.0.7/1"
        name                  = "jumpserver_2019"
      + supported_os_versions = []
        tags                  = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "NOMIS"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
            "ec2launch-v2-windows-version"            = "1.0.0"
            "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
            "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.8"
            "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.8"
            "is-production"                           = "true"
            "jumpserver_2019-version"                 = "1.0.7"
            "os-version"                              = "windows server 2019"
            "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                        = "release"
            "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["jumpserver_2019.yml"] will be destroyed
  # (because key ["jumpserver_2019.yml"] is not in for_each map)
  - resource "aws_imagebuilder_component" "this" {
      - arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver-2019/1.0.7/1" -> null
      - data                  = <<-EOT
            ---
            name: jumpserver_2019
            description: Jumpserver provisioner component.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 1.0.7
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: ConfigureJava
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $S3_BUCKET = "ec2-image-builder-nomis20220314103938567000000001"
            
                          # Download/Install Java
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/jre-6u33-windows-i586.exe -File C:\jumpserver-software\jre-6u33-windows-i586.exe
                          Start-Process -Wait -FilePath "C:\jumpserver-software\jre-6u33-windows-i586.exe" -ArgumentList "/qn", "/s", "/v" -PassThru -RedirectStandardOutput "C:\jumpserver-software\jre-install.log"
            
                          # Copy deployment config files
                          $deployment_folder = "C:\Windows\Sun\Java\Deployment"
                          New-Item -Path $deployment_folder -ItemType Directory -Force
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/deployment.config -File $deployment_folder\deployment.config
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/deployment.properties -File $deployment_folder\deployment.properties
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/trusted.certs -File $deployment_folder\trusted.certs
            
                          # Prevent Java update check
                          Remove-ItemProperty -Path "HKLM:\SOFTWARE\Wow6432Node\Microsoft\Windows\CurrentVersion\Run" -Name SunJavaUpdateSched -Force -ErrorAction SilentlyContinue
                  - name: ConfigureTrustedSites
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          # Add Nomis sites to trusted sites
                          $sites = @(
                              "*.nomis.hmpps-development.modernisation-platform.justice.gov.uk"
                              "*.nomis.hmpps-test.modernisation-platform.justice.gov.uk"
                              "*.nomis.hmpps-preproduction.modernisation-platform.justice.gov.uk"
                              "*.nomis.hmpps-production.modernisation-platform.justice.gov.uk"
                              "*.nomis.service.justice.gov.uk"
                              "*.nomis.az.justice.gov.uk"
                              "*.hmpp-azdt.justice.gov.uk"
                          )
            
                          $paths = @(
                              "HKLM:\Software\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\Domains"
                              "HKLM:\Software\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\EscDomains"
                          )
            
                          foreach($path in $paths){
                            $sites | ForEach-Object {
                                New-Item -Path $path\$_ -Force
                                New-ItemProperty -Path $path\$_ -Name http -Value 2 -PropertyType DWORD -Force
                                New-ItemProperty -Path $path\$_ -Name https -Value 2 -PropertyType DWORD -Force
                            }
                          }
            
                          # Use Local Machine settings for Internet Security Settings
                          $reg_path = "HKLM:\Software\Policies\Microsoft\Windows\CurrentVersion\Internet Settings"
                          New-Item -Path $reg_path -Force
                          New-ItemProperty -Path $reg_path -Name Security_HKLM_only -Value 1 -PropertyType DWORD -Force
                  - name: ConfigureEdge
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          # Turn off Edge first run experience
                          $reg_path = "HKLM:\SOFTWARE\Policies\Microsoft\Edge"
                          New-Item -Path $reg_path -Force
                          New-ItemProperty -Path $reg_path -Name HideFirstRunExperience -Value 1 -PropertyType DWORD -Force
            
                          # Turn on Edge IE Mode using reg_path from previous step
                          New-ItemProperty -Path $reg_path -Name InternetExplorerIntegrationLevel -Value 1 -PropertyType DWORD -Force
            
                          $compatibility_site_list = @(
                              "t1-nomis-web-a.test.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "t1-nomis-web-a.test.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "t1-nomis-web-b.test.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "t1-nomis-web-b.test.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "t1-cn.hmpp-azdt.justice.gov.uk:7777/forms/frmservlet?config=tag"
                              "t1-cn.hmpp-azdt.justice.gov.uk/forms/frmservlet?config=tag"
                              "c-t1.test.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "c-t1.test.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "t2-nomis-web-a.test.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "t2-nomis-web-a.test.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "t2-nomis-web-b.test.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "t2-nomis-web-b.test.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "t2-cn.hmpp-azdt.justice.gov.uk/forms/frmservlet?config=tag"
                              "c-t2.test.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "c-t2.test.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "t3-nomis-web-a.test.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "t3-nomis-web-a.test.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "t3-nomis-web-b.test.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "t3-nomis-web-b.test.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "t3-cn.hmpp-azdt.justice.gov.uk/forms/frmservlet?config=tag"
                              "t3-cn-ha.hmpp-azdt.justice.gov.uk/forms/frmservlet?config=tag"
                              "c-t3.test.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "c-t3.test.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "preprod-nomis-web-a.preproduction.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "preprod-nomis-web-a.preproduction.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "preprod-nomis-web-b.preproduction.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "preprod-nomis-web-b.preproduction.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "c.pp-nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "c.preproduction.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "c.preproduction.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "prod-nomis-web-a.production.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "prod-nomis-web-a.production.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "prod-nomis-web-b.production.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "prod-nomis-web-b.production.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "c.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "c.production.nomis.az.justice.gov.uk/forms/frmservlet?config=tag"
                              "c.production.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                              "c.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                          )
            
                          # Add sites to Edge IE Mode compatibility list
                          $compatibility_site_list_path = "C:\\compatibility_site_list.xml"
            
                          $xmlDoc = New-Object System.Xml.XmlDocument
                          $root = $xmlDoc.CreateElement("site-list")
                          $root.SetAttribute('version', 1)
                          $xmlDoc.AppendChild($root)
            
                          $created_byElement = $xmlDoc.CreateElement("created-by")
            
                          $toolElement = $xmlDoc.CreateElement("tool")
                          $versionElement = $xmlDoc.CreateElement("version")
                          $date_createdElement = $xmlDoc.CreateElement("date_created")
                          $toolElement.InnerText = "EMIESiteListManager"
                          $versionElement.InnerText = "10.0.0.0"
                          $date_createdElement.InnerText = $(Get-Date -Format "MM/dd/yyyy hh:mm:ss")
                          $created_byElement.AppendChild($toolElement)
                          $created_byElement.AppendChild($versionElement)
                          $created_byElement.AppendChild($date_createdElement)
                          $root.AppendChild($created_byElement)
            
                          foreach ($site in $compatibility_site_list) {
                            $siteElement = $xmlDoc.CreateElement("site")
                            $siteElement.SetAttribute('url', $site)
                            $compatModeElement = $xmlDoc.CreateElement("compat-mode")
                            $openInElement = $xmlDoc.CreateElement("open-in")
                            $compatModeElement.InnerText = "Default"
                            $openInElement.InnerText = "IE11"
                            $siteElement.AppendChild($compatModeElement)
                            $siteElement.AppendChild($openInElement)
                            $root.AppendChild($siteElement)
                          }
            
                          $xmlDoc.Save($compatibility_site_list_path)
            
                          # Add compatibility list to registry
                          New-ItemProperty -Path $reg_path -Name InternetExplorerIntegrationSiteList -Value $compatibility_site_list_path -PropertyType String -Force
            
                          # Allow popups for .justice.gov.uk urls
                          $reg_path = "HKLM:\SOFTWARE\Policies\Microsoft\Edge\PopupsAllowedForUrls"
                          New-Item -Path $reg_path -Force
                          New-ItemProperty -Path $reg_path -Name 1 -Value "[*.]justice.gov.uk" -PropertyType String -Force
                  - name: ConfigureDesktopShortcut
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          # Create Desktop Shortcut to Nomis
                          $new_object = New-Object -ComObject WScript.Shell
                          $destination = $new_object.SpecialFolders.Item("AllUsersDesktop")
                          $source_path = Join-Path -Path $destination -ChildPath "\\C-Nomis.url"
                          $source = $new_object.CreateShortcut($source_path)
                          $source.TargetPath = "https://c-t1.test.nomis.service.justice.gov.uk/forms/frmservlet?config=tag"
                          $source.Save()
                  - name: ConfigureSQLDeveloper
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $S3_BUCKET = "ec2-image-builder-nomis20220314103938567000000001"
            
                          # Download SQL Developer
                          Read-S3Object -BucketName $S3_BUCKET -Key jumpserver-software/sqldeveloper-22.2.1.234.1810-x64.zip -File C:\jumpserver-software\sqldeveloper-22.2.1.234.1810-x64.zip
            
                          # Extract SQL Developer - there is no installer for this application
                          Expand-Archive -Path C:\jumpserver-software\sqldeveloper-22.2.1.234.1810-x64.zip -DestinationPath "C:\Program Files\Oracle"
            
                          # Create a desktop shortcut
                          $shortcut = New-Object -ComObject WScript.Shell
                          $shortcut_link = $shortcut.CreateShortcut("C:\Users\Public\Desktop\SQL Developer.lnk")
                          $shortcut_link.TargetPath = "C:\Program Files\Oracle\sqldeveloper\sqldeveloper.exe"
                          $shortcut_link.Save()
                  - name: InstallLibreOffice
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          choco install -y libreoffice-still
        EOT -> null
      - date_created          = "2023-05-24T14:53:36.623Z" -> null
      - description           = "Jumpserver provisioner component." -> null
      - encrypted             = true -> null
      - id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver-2019/1.0.7/1" -> null
      - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
      - name                  = "jumpserver_2019" -> null
      - owner                 = "374269020027" -> null
      - platform              = "Windows" -> null
      - skip_destroy          = false -> null
      - supported_os_versions = [] -> null
      - tags                  = {
          - "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          - "application"                             = "NOMIS"
          - "branch"                                  = "main"
          - "business-unit"                           = "HMPPS"
          - "ec2launch-v2-windows-version"            = "1.0.0"
          - "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          - "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.8"
          - "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.8"
          - "is-production"                           = "true"
          - "jumpserver_2019-version"                 = "1.0.7"
          - "os-version"                              = "windows server 2019"
          - "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          - "release-or-patch"                        = "release"
          - "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        } -> null
      - tags_all              = {
          - "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          - "application"                             = "NOMIS"
          - "branch"                                  = "main"
          - "business-unit"                           = "HMPPS"
          - "ec2launch-v2-windows-version"            = "1.0.0"
          - "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          - "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.8"
          - "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.8"
          - "is-production"                           = "true"
          - "jumpserver_2019-version"                 = "1.0.7"
          - "os-version"                              = "windows server 2019"
          - "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          - "release-or-patch"                        = "release"
          - "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        } -> null
      - type                  = "BUILD" -> null
      - version               = "1.0.7" -> null
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2019-jumpserver"
        name         = "nomis_windows_server_2019_jumpserver"
      ~ tags         = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          - "jumpserver_2019-version"                 = "1.0.7" -> null
            # (11 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          - "jumpserver_2019-version"                 = "1.0.7" -> null
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-windows-server-2019-jumpserver" -> (known after apply)
      ~ date_created                     = "2023-05-24T14:53:39.070Z" -> (known after apply)
      ~ date_last_run                    = "2023-06-02T00:00:06.603Z" -> (known after apply)
      ~ date_next_run                    = "2023-07-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-05-24T14:53:39.070Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-windows-server-2019-jumpserver" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2019-jumpserver/0.0.8" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2019-jumpserver-0-0-8" -> (known after apply)
        name                             = "nomis_windows_server_2019_jumpserver"
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          - "jumpserver_2019-version"                 = "1.0.7" -> null
            # (11 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          - "jumpserver_2019-version"                 = "1.0.7" -> null
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2019-jumpserver/0.0.8" -> (known after apply)
      ~ date_created      = "2023-05-24T14:53:38.247Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2019-jumpserver/0.0.8" -> (known after apply)
        name              = "nomis_windows_server_2019_jumpserver"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Windows" -> (known after apply)
      ~ tags              = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          - "jumpserver_2019-version"                 = "1.0.7" -> null
            # (11 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          - "jumpserver_2019-version"                 = "1.0.7" -> null
            # (11 unchanged elements hidden)
        }
      + user_data_base64  = (known after apply)
      ~ version           = "0.0.8" -> "0.1.0" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      - component { # forces replacement
          - component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver-2019/1.0.7/1" -> null # forces replacement
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2019-jumpserver-0-0-8" -> (known after apply)
      ~ date_created                  = "2023-05-24T14:53:36.166Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2019-jumpserver-0-0-8" -> (known after apply)
      ~ name                          = "nomis_windows_server_2019_jumpserver_0_0_8" -> "nomis_windows_server_2019_jumpserver_0_1_0" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          - "jumpserver_2019-version"                 = "1.0.7" -> null
            # (11 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          - "jumpserver_2019-version"                 = "1.0.7" -> null
            # (11 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.8" -> "nomis_windows_server_2019_jumpserver/0.1.0"
          - "jumpserver_2019-version"                 = "1.0.7" -> null
            # (11 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 4 to destroy.

```
